# https://github.com/Homebrew/homebrew-bundle
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "denisidoro/tools"
tap "buo/cask-upgrade"
tap "null-dev/firefox-profile-switcher"
# Manage your dotfiles across multiple machines, securely
# https://github.com/twpayne/chezmoi
brew "chezmoi"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Generic library support script
brew "libtool"
# Terminal-based visual file manager
# https://github.com/MidnightCommander/mc
brew "midnight-commander"
# Keep your Mac's application settings in sync
# https://github.com/lra/mackup
# brew "mackup"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Terminal multiplexer
brew "tmux"
# UNIX shell (command interpreter)
# https://github.com/ohmyzsh/ohmyzsh
brew "zsh"
# Command-line fuzzy finder written in Go
brew "fzf"
# Tracks most-used directories to make cd smarter
brew "z"
# Interactive cheatsheet tool for the command-line.
brew "denisidoro/tools/navi"
# An archey script for OS X. archey -c
# https://obihann.github.io/archey-osx/
brew "archey"
# The cross-shell prompt for astronauts
# https://starship.rs/
brew "starship"
#
brew "reattach-to-user-namespace"
# https://obsidian.md/
cask "obsidian"
if OS.mac?
# --- Casks
# https://www.mozilla.org/en-GB/firefox/
cask "firefox"
# https://addons.mozilla.org/en-GB/firefox/addon/profile-switcher/
brew "firefox-profile-switcher-connector"
# https://www.opera.com/
# cask "opera"
# https://www.google.com/intl/en_uk/chrome/
cask "google-chrome"
# https://github.com/gnachman/iTerm2
cask "iterm2"
# This is a tool for powerful automation of OS X.
# https://github.com/Hammerspoon/hammerspoon
cask "hammerspoon"
# CCleaner is the number-one tool for fixing a slow Mac
# https://www.ccleaner.com/ccleaner-mac
cask "ccleaner"
# Clipy is a Clipboard extension app for macOS.
# https://github.com/Clipy/Clipy
cask "clipy"
# https://www.gnu.org/software/grep/
# https://formulae.brew.sh/formula/grep
brew "grep"
end
